{
  "analysis_all_hatchery_district_wise": {
    "description": "Hatchery analysis data by district and year. Tracks functional/non-functional departmental hatcheries, owner-built hatcheries, and exotic/IMC (Indian Major Carp) production metrics for fish breeding programs. Contains data for 26 districts with details on hatchery infrastructure and fish seed production capacity.",
    "columns": {
      "id": "Unique identifier for the record",
      "sector_name": "Sector name - Animal & Fisheries Department",
      "division_name": "Administrative division name (9 divisions in Bihar)",
      "district_name": "District name where hatcheries are located",
      "year": "Financial year of the record",
      "source": "Source of data - Animal & Fisheries Department",
      "number_of_departmental_scheme_hatcheries_non_functional_Number": "Count of non-functional hatcheries built under departmental schemes",
      "number_of_functional_hatcheries_Number": "Count of functional hatcheries operational in the district",
      "number_of_hatcheries_built_by_departmental_schemes_Number": "Total count of hatcheries constructed by departmental schemes",
      "number_of_hatcheries_built_by_owner_Number": "Count of hatcheries built and operated by private owners",
      "number_of_non_functional_hatcheries_Number": "Total count of non-operational/defunct hatcheries",
      "total_number_of_hatcheries_Number": "Total number of all hatcheries (functional and non-functional) in the district",
      "total_production_of_exotic_fingerling_Lakh": "Total production of exotic fish fingerlings in Lakh units",
      "total_production_of_exotic_fry_Lakh": "Total production of exotic fish fry in Lakh units",
      "total_production_of_exotic_spawn_Lakh": "Total production of exotic fish spawn (eggs) in Lakh units",
      "total_production_of_imc_fingerling_Lakh": "Total production of Indian Major Carp (IMC) fingerlings in Lakh units",
      "total_production_of_imc_fry_Lakh": "Total production of Indian Major Carp (IMC) fry in Lakh units",
      "total_production_of_imc_spawn_Lakh": "Total production of Indian Major Carp (IMC) spawn (eggs) in Lakh units"
    }
  },
  "areas_without_jalkars_by_range_district_block_panchayat": {
    "description": "Geographic inventory of areas without jalkars (water bodies) at panchayat level across Bihar. Lists all panchayats organized by administrative hierarchy (division, district, block) that do not have designated water bodies for fisheries activities. Contains 1675 records identifying gaps in water body coverage.",
    "columns": {
      "division_name": "Administrative division name (9 divisions in Bihar)",
      "district_name": "District name in which the panchayat is located",
      "block_name": "Block/sub-district name within the district",
      "panchayat_name": "Panchayat (village council) name without any jalkar resources"
    }
  },
  "details_fcs_district_wise": {
    "description": "Fisheries Cooperative Society (FCS) aggregate statistics by district and year. Provides district-level summary of cooperative societies including total number of cooperatives, membership count broken down by gender, and block distribution. Contains 76 records covering 38 districts across 2 years.",
    "columns": {
      "id": "Unique identifier for the record",
      "sector_name": "Sector name - Animal & Fisheries Department",
      "division_name": "Administrative division name",
      "district_name": "District name (38 districts in Bihar)",
      "year": "Financial year of the data",
      "source": "Source of data - Animal & Fisheries Department",
      "total_number_of_blocks_in_districts_Number": "Total number of administrative blocks/taluks in the district",
      "total_number_of_cooperative_societies_in_districts_Number": "Total count of registered Fisheries Cooperative Societies (FCS) in the district",
      "total_number_of_female_members_Number": "Total number of female members enrolled across all FCS in the district",
      "total_number_of_male_members_Number": "Total number of male members enrolled across all FCS in the district",
      "total_number_of_members_in_societies_Number": "Total membership (male + female) across all FCS in the district"
    }
  },
  "details_newly_formed_fcs_district_wise": {
    "description": "Individual records of newly formed Fisheries Cooperative Societies (FCS) with complete organizational and membership details. Includes FCS name, location details, member enrollment information, registration date, and classification as Inland or Marine cooperative. Contains 497 records of new cooperatives established across Bihar.",
    "columns": {
      "id": "Unique identifier for the record",
      "division_name": "Administrative division name where FCS is established",
      "district_name": "District name where FCS operates",
      "name_of_newly_formed_cooperative_societies": "Official name of the newly formed Fisheries Cooperative Society",
      "block_name": "Block/sub-district where the FCS headquarters is located",
      "total_number_of_members_enrolled": "Total number of members registered in the FCS",
      "total_number_of_male_members_enrolled": "Number of male members in the FCS",
      "total_number_of_female_members_enrolled": "Number of female members in the FCS",
      "date_of_registration": "Date when the FCS was officially registered (DD.MM.YYYY format)",
      "year": "Year of FCS formation/establishment",
      "whether_Inland_or_Marine_FCS": "Classification of FCS - Inland (freshwater) or Marine (saltwater) fisheries"
    }
  },
  "jalkars_spread_across_multiple_panchayats_block_district_range_w": {
    "description": "Detailed records of jalkars (water bodies) that span across multiple panchayat boundaries, requiring inter-panchayat administration. Documents shared water resources organized by administrative division, district, block, and panchayat with area and revenue information. Contains 205 records of multi-panchayat jalkars.",
    "columns": {
      "division_name": "Administrative division name where the jalkar is primarily located",
      "block_name": "Block/sub-district name within the district",
      "panchayat_name": "Primary panchayat name where the jalkar originates",
      "total_rakba_in_hectares": "Total area of the water body (jalkar) measured in hectares",
      "total_jamarashi_in_lakh_rupees": "Total revenue/demand amount for the jalkar in Lakh Rupees",
      "jalkars_located_in_multiple_panchayat": "Name or identifier of secondary panchayat(s) where the jalkar extends beyond the primary panchayat boundary",
      "district_name": "District name where the jalkar is located",
      "jalkar_name": "Official name/identifier of the water body (jalkar)"
    }
  },
  "list_of_jalkars_with_unclear_settlement_status_panchayat_wise": {
    "description": "PRIMARY TABLE: Comprehensive inventory of 31,036 jalkars (water bodies) with detailed information at panchayat level across all 38 Bihar districts. Contains jalkar names, locations, settlement status (Settled With Co-Operative, Unsettled, Open Bid, Close Bid, Free Fishing, etc.), land records (khata, khasra), area measurements, security deposits, and special designations (free fishing zones, PERTA, court cases). Use for queries about: jalkar names/counts by district/division/block/panchayat, settlement status, security deposits, PERTA jalkars, free fishing zones, court cases, land records. Search keywords: jalkar, water body, settlement status, unsettled, co-operative, open bid, close bid, free fishing, PERTA, khata, khasra, security deposit, court case, panchayat wise, district wise, block wise, jalkar name, jalkar list, jalkar count, jalkar distribution, jalkar breakdown.",
    "columns": {
      "division_name": "Administrative division name where the jalkar is located",
      "district_name": "District name where the jalkar is located",
      "block_name": "Block/sub-district name within the district",
      "panchayat_name": "Panchayat (village council) name where the jalkar is situated",
      "jalkars_name": "Official name/identifier of the water body (jalkar)",
      "khata_number": "Land record khata (account/lease) number in the revenue system",
      "khasra_number": "Khasra (individual plot) number identifying the specific land parcel of the water body",
      "total_rakba_in_hectares": "Total area of the water body measured in hectares",
      "settlement_status": "Current settlement/lease status of the jalkar (Settled, Unsettled, In Dispute, With Co-operative, etc.)",
      "security_deposit_amount_in_lakh": "Security deposit/lease fee collected for the jalkar in Lakh Rupees",
      "number_of_jalkars_pending_in_court_cases": "Count of jalkars with legal/court cases pending resolution",
      "area_of_jalkars_pending_in_court_cases_in_hectares": "Total area of jalkars under court litigation measured in hectares",
      "number_of_jalkars_declared_for_free_fishing": "Count of jalkars designated for free/open fishing zones for public benefit",
      "area_of_jalkars_declared_for_free_fishing_in_hectares": "Total area of free fishing jalkars measured in hectares",
      "number_of_jalkars_declared_as_perta": "Count of jalkars declared under PERTA (Pradesh Environmental Resource Tax on Aquaculture) scheme",
      "area_of_jalkars_declared_as_perta_in_hectares": "Total area of PERTA jalkars measured in hectares",
      "amount_of_jalkars_declared_as_perta_in_lakh": "Revenue collected from PERTA jalkars in Lakh Rupees"
    }
  },
  "total_revenue_jalkar_report": {
    "description": "Annual district-level fisheries production and revenue report tracking targets and actuals. Comprehensive data on fish production from all aquatic resources, seed production by type (fingerling, fry, spawn, yearling), inter-state trade (export/import), and revenue collection. Contains 76 records covering 38 districts across multiple years.",
    "columns": {
      "id": "Unique identifier for the record",
      "sector_name": "Sector name - Animal & Fisheries Department",
      "division_name": "Administrative division name",
      "district_name": "District name (38 districts in Bihar)",
      "year": "Financial year of the report",
      "source": "Source of data - Directorate of Fisheries",
      "annual_fish_production_target_from_all_aquatic_resources_Thousan": "Annual fish production target from all aquatic resources in Thousand Metric Tons",
      "annual_revenue_collected_against_the_target_Lakh_Rupees": "Actual annual revenue collected from fisheries against the target in Lakh Rupees",
      "annual_revenue_collection_target_from_jalkar_settlement_Lakh_Rup": "Revenue collection target specifically from jalkar (water body) settlement/lease fees in Lakh Rupees",
      "current_fish_exported_to_other_states_Thousand_Metric_Tons": "Quantity of fish currently exported from Bihar to other states in Thousand Metric Tons",
      "current_fish_imported_from_other_states_Thousand_Metric_Tons": "Quantity of fish currently imported into Bihar from other states in Thousand Metric Tons",
      "current_fish_production_Thousand_Metric_Tons": "Actual current fish production in the district in Thousand Metric Tons",
      "fish_seed_fingerling_current_production_Number": "Current production of fish fingerlings (juvenile stage) in numbers",
      "fish_seed_fry_current_production_Number": "Current production of fish fry (larval stage) in numbers",
      "fish_seed_production_fry_annual_target_Number": "Annual target for fish fry production in numbers",
      "fish_seed_production_spawn_current_count_Number": "Current production of fish spawn (eggs) in numbers",
      "fish_seed_yearling_current_production_Number": "Current production of fish yearlings (1-year-old juveniles) in numbers"
    }
  }
}
